# LSE Department of Economics 

-----

# Python Weekend

8th February 2020

# Purpose of the weekend 

* Explore how python can be used to answer an economic policy question 
* Develop python skills 
* Learn how economist use python in industry

# Tackling a policy question 

1. Theory/ literature (less time on this - but in practise this is your motivation!) 
2. Hypothesis 
3. What does the data say 
4. How is the analysis relevant to the question? 
5. Implications

# Principles for dealing with errors 

How to read errors and knowing what to Google 

__Smart searching__ 
    * Google is your friend, but know WHAT to search for 
__Check before freaking out__ 
    * Syntax error can sometimes mean you've forgotten a ' or ) or ; check your code before freaking out 
__Discuss with your team__
    * There might be an easier way to do what you're building!

# Getting Started

# Packages

For the purposes of the weekend, you will use the following packages unless prompted otherwise. They will suffice you for much of your python work in general. 

* pandas
* numpy
* matplotlib.pyplot

## Slight differences 

For simulation groups you'll also use: 
* itertools
* random
* copy

For data groups you may also use: 
* seaborn
* geopandas

# Pandas: DataFrames
There are two data structures in Pandas

* Series are one dimensional, homogeneous arrays
* DataFrames are two-dimensional arrays with heterogeneous columns


DataFrames can be constructed from collections such as lists or dictionaries and from existing records, such as ndarray.

# Importing Data
Pandas can import many file formats. 

The most important ones are excel spreasheets (.csvand.xlsfiles). To import a csv file use read_csv()

You can use lots of formats here are a few:
* pd.read_csv(filename) | From a CSV file
* pd.read_table(filename) | From a delimited text file (like TSV)
* pd.read_excel(filename) | From an Excel file
* pd.read_stata(filename) | From a Stata DTA file

The OECD data used in this example is available [here.]("https://data.oecd.org/energy/renewable-energy.htm")

In [1]:
import pandas as pd
df = pd.read_csv('Datasets/OECD (2019) Renewable energy.csv', parse_dates = ['TIME'])
df

,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,AUS,RENEWABLE,TOT,KTOE,A,1960-01-01,4437.656,NaN
1,AUS,RENEWABLE,TOT,KTOE,A,1961-01-01,4491.224,NaN
2,AUS,RENEWABLE,TOT,KTOE,A,1962-01-01,4407.786,NaN
3,AUS,RENEWABLE,TOT,KTOE,A,1963-01-01,4629.416,NaN
4,AUS,RENEWABLE,TOT,KTOE,A,1964-01-01,4498.041,NaN
...,...,...,...,...,...,...,...,...
16550,OECD,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,2014-01-01,9.430,NaN
16551,OECD,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,2015-01-01,9.640,NaN
16552,OECD,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,2016-01-01,9.870,NaN
16553,OECD,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,2017-01-01,10.170,NaN
16554,OECD,RENEWABLE,TOT,PC_PRYENRGSUPPLY,A,2018-01-01,10.450,NaN

# Inspecting your data 

In the real world, you might end up with a dataset that is too big to open in excel, but you need to understand what that dataset is before doing any analysis or visusations. 

Here are some simple commands to get you comfortable with using data

## Useful commands to know 

* df.head(n) | First n rows of the DataFrame
* df.tail(n) | Last n rows of the DataFrame
* df.shape | Number of rows and columns
* df.info() | Index, Datatype and Memory information
* df.describe() | Summary statistics for numerical columns
* df.apply(pd.Series.value_counts) | Unique values and counts for all columns

All of these commands and more can be found in the cheat sheets. But lets see some examples.

## Summarising data

We'll continue using the data we've just seen on renewable energy

In [3]:
df.head(n=2)

,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,AUS,RENEWABLE,TOT,KTOE,A,1960-01-01,4437.656,NaN
1,AUS,RENEWABLE,TOT,KTOE,A,1961-01-01,4491.224,NaN

In [4]:
df.describe()

              Value
count  1.266700e+04
mean   1.247881e+04
std    8.989501e+04
min    0.000000e+00
25%    9.470000e+00
50%    7.343000e+01
75%    1.812338e+03
max    1.881792e+06

In [5]:
df.shape

(16555, 8)

# Adding and Deleting Data

We can add columns with data.insert(), rows with data.loc() and delete data with data.drop().

In [13]:
df.insert(8, "newcol", True) ##add newcol


df.head(n=2)

,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes,newcol
0,AUS,RENEWABLE,TOT,KTOE,A,1960-01-01,4437.656,NaN,True
1,AUS,RENEWABLE,TOT,KTOE,A,1961-01-01,4491.224,NaN,True

In [14]:
df = df.drop(columns="newcol") ##drop column
df.head(n=2)

,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,AUS,RENEWABLE,TOT,KTOE,A,1960-01-01,4437.656,NaN
1,AUS,RENEWABLE,TOT,KTOE,A,1961-01-01,4491.224,NaN

# Data cleaning and manipulation 

* df.columns = ['a','b','c'] | Rename columns
* pd.isnull() | Checks for null Values, Returns Boolean Arrray
* pd.notnull() | Opposite of pd.isnull()
* df.sort_values(col1) | Sort values by col1 in ascending order
* df.sort_values(col2,ascending=False) | Sort values by col2 in descending order
* df1.append(df2) | Add the rows in df1 to the end of df2 (columns should be identical)
* pd.concat([df1, df2],axis=1) | Add the columns in df1 to the end of df2 (rows should be identical)
* df1.join(df2,on=col1,how='inner') | SQL-style join the columns in df1 with the columns on df2 where the rows for col have identical values. 'how' can be one of 'left', 'right', 'outer', 'inner'

Again there is an extensive list of ways you can manipulate your data, which you can find in the cheat sheets.

Let's do some examples to help it make sense.

# Concatenating Data
Concatenation is simply adding data. In the following example we concatenate along the index axis (i.e. we add rows). For this we have three steps

* we create the dataframes, and index rows uniquely,
* we then create a list of the three dataframes,
* we concatenate the dataframes using pd.concat()

In [15]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])

In [16]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                     'B': ['B4', 'B5', 'B6', 'B7'],
                     'C': ['C4', 'C5', 'C6', 'C7'],
                     'D': ['D4', 'D5', 'D6', 'D7']},
                    index=[4, 5, 6, 7])

In [19]:
frames = [df1, df2]

result = pd.concat(frames)

In [20]:
result

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

More helpfully, you actually be merging dataframes

# Merging Data
Merging is very similar to concatenating. The difference is that DataFrames are joined based on keys and not that data is simply added.

Here we join two dataframes based one unique key, which is needed to uniquely identify rows or columns. The key can be either columns or indexes. There are generally four ways to merge:

* left (based on the first dataframe)
* right (based on the second dataframe)
* inner (default; intersection if dataframes)
* outer (union of dataframes)

Pandas also allow for more complex merging operations on multiple keys.

In [21]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'A': ['A0', 'A1', 'A2', 'A3'],
                      'B': ['B0', 'B1', 'B2', 'B3']})
 
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [22]:
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                       'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']})
    
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [23]:
result = pd.merge(left, right, on='key', indicator=True)
result

  key   A   B   C   D _merge
0  K0  A0  B0  C0  D0   both
1  K1  A1  B1  C1  D1   both
2  K2  A2  B2  C2  D2   both
3  K3  A3  B3  C3  D3   both

# Tips for creating good visualisations

Python can be fiddly when it comes to making nice charts. 

Here are some simple hacks